In [1]:
import pandas as pd

In [2]:
county_df = pd.read_csv('data/county_info.csv')

# County Financial DF

In [3]:
county_df.head()

,number,county,State,per capita income,median household income,median family income,population,number of households
0,1,New York County,New York,"$62,498","$69,659","$84,627","1,605,272","736,192"
1,2,Arlington,Virginia,"$62,018","$103,208","$139,244","214,861","94,454"
2,3,Falls Church City,Virginia,"$59,088","$120,000","$152,857","12,731","5,020"
3,4,Marin,California,"$56,791","$90,839","$117,357","254,643","102,912"
4,5,Alexandria City,Virginia,"$54,608","$85,706","$107,511","143,684","65,369"

In [4]:
print('shape')
print(county_df.shape)
print('-' *40)
county_df.columns

shape
(3233, 8)
----------------------------------------

Index(['number', 'county', 'State', 'per capita income',
       'median household income', 'median family income', 'population',
       'number of households'],
      dtype='object')

In [5]:
county_df['State'].unique()

array(['New York', 'Virginia', 'California', 'Colorado', 'New Mexico',
       'New Jersey', 'Texas', 'Maryland', 'Connecticut', 'Massachusetts',
       'Alaska', 'Hawaii', 'District of Columbia', 'Wyoming', 'Utah',
       'Pennsylvania', 'Wisconsin', 'Tennessee', 'Rhode Island', 'Ohio',
       'Washington', 'Indiana', 'Kansas', 'North Dakota', 'Illinois',
       'New Hampshire', 'Minnesota', 'Florida', 'Georgia', 'Michigan',
       'South Dakota', 'Iowa', 'Idaho', 'Missouri', 'North Carolina',
       'Nevada', 'Kentucky', 'Alabama', 'Vermont', 'Mississippi',
       'Montana', 'Maine', 'Oregon', 'South Carolina', 'Delaware',
       'Nebraska', 'Louisiana', 'West Virginia', 'Oklahoma', 'Arkansas',
       'Arizona', 'U.S. Virgin Islands', 'Puerto Rico', nan, 'Guam',
       'Northern Mariana Islands', 'American Samoa'], dtype=object)

In [6]:
states_drop = ['Guam', 'Northern Mariana Islands', 'American Samoa', 
               'U.S. Virgin Islands', 'Puerto Rico', 'Alaska', 'Hawaii']

In [7]:
county_df = county_df[~county_df['State'].isin(states_drop)]

## Investigate and address nulls

In [8]:
county_df['number'].nunique()

3111

- Unnecessary column

In [9]:
county_df.drop(columns='number', axis=1, inplace=True)

In [10]:
county_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3113 entries, 0 to 3208
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   county                   3109 non-null   object
 1   State                    3111 non-null   object
 2   per capita income        3113 non-null   object
 3   median household income  3111 non-null   object
 4   median family income     3111 non-null   object
 5   population               3111 non-null   object
 6   number of households     3111 non-null   object
dtypes: object(7)
memory usage: 194.6+ KB

In [11]:
county_df.isna().sum()

county                     4
State                      2
per capita income          0
median household income    2
median family income       2
population                 2
number of households       2
dtype: int64

In [12]:
county_df.dropna(inplace=True)

In [13]:
county_df.isna().sum()

county                     0
State                      0
per capita income          0
median household income    0
median family income       0
population                 0
number of households       0
dtype: int64

In [14]:
county_df.head()

,county,State,per capita income,median household income,median family income,population,number of households
0,New York County,New York,"$62,498","$69,659","$84,627","1,605,272","736,192"
1,Arlington,Virginia,"$62,018","$103,208","$139,244","214,861","94,454"
2,Falls Church City,Virginia,"$59,088","$120,000","$152,857","12,731","5,020"
3,Marin,California,"$56,791","$90,839","$117,357","254,643","102,912"
4,Alexandria City,Virginia,"$54,608","$85,706","$107,511","143,684","65,369"

## Replace punctuation

In [15]:
to_replace = ['$', ",", " "]
punc_replace_list = ['per capita income', 'median household income', 'median family income', 
                     'population', 'number of households']

In [16]:
def replace_punctuation(dfName, colNames):
    for colName in colNames:
        dfName[colName]=dfName[colName].str.replace(" ","")
        dfName[colName]=dfName[colName].str.replace(",","")
        dfName[colName]=dfName[colName].str.replace("$","")
        dfName[colName]=dfName[colName].astype(int)

In [17]:
replace_punctuation(county_df, punc_replace_list)

In [18]:
county_df.head()

,county,State,per capita income,median household income,median family income,population,number of households
0,New York County,New York,62498,69659,84627,1605272,736192
1,Arlington,Virginia,62018,103208,139244,214861,94454
2,Falls Church City,Virginia,59088,120000,152857,12731,5020
3,Marin,California,56791,90839,117357,254643,102912
4,Alexandria City,Virginia,54608,85706,107511,143684,65369

In [19]:
county_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3109 entries, 0 to 3208
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   county                   3109 non-null   object
 1   State                    3109 non-null   object
 2   per capita income        3109 non-null   int32
 3   median household income  3109 non-null   int32
 4   median family income     3109 non-null   int32
 5   population               3109 non-null   int32
 6   number of households     3109 non-null   int32
dtypes: int32(5), object(2)
memory usage: 133.6+ KB

##### To CSV

In [20]:
county_df.to_csv('data/cleaned_county_df.csv', index=0)